In [1]:
!pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [3]:
df = pd.read_csv('/Users/chimaojini/Downloads/Sales Dataset - Sales Dataset.csv')
df.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City,Year-Month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

In [4]:
df.columns

Index(['Order ID', 'Amount', 'Profit', 'Quantity', 'Category', 'Sub-Category',
       'PaymentMode', 'Order Date', 'CustomerName', 'State', 'City',
       'Year-Month'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1194 non-null   object
 1   Amount        1194 non-null   int64
 2   Profit        1194 non-null   int64
 3   Quantity      1194 non-null   int64
 4   Category      1194 non-null   object
 5   Sub-Category  1194 non-null   object
 6   PaymentMode   1194 non-null   object
 7   Order Date    1194 non-null   object
 8   CustomerName  1194 non-null   object
 9   State         1194 non-null   object
 10  City          1194 non-null   object
 11  Year-Month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [6]:
#standardize the name of the columns(rename space to undersorce)
df.columns=(
    df.columns.str.strip()
    .str.lower()
    .str.replace(' ', '_',regex=True)
    .str.replace('-', '_',regex=True)
)
df.head()

,order_id,amount,profit,quantity,category,sub_category,paymentmode,order_date,customername,state,city,year_month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

In [7]:
df.columns

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub_category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year_month'],
      dtype='object')

In [8]:
# Customer Table
customer_df = df[['customername', 'state', 'city']].drop_duplicates().reset_index(drop=True)
customer_df['customer_id'] = range(1, len(customer_df) + 1)
customer_df = customer_df[['customer_id', 'customername', 'state', 'city']]

In [9]:
customer_df.head()

   customer_id   customername     state     city
0            1  David Padilla   Florida    Miami
1            2  Connor Morgan  Illinois  Chicago
2            3   Robert Stone  New York  Buffalo
3            4    John Fields   Florida  Orlando
4            5  Clayton Smith   Florida    Miami

In [10]:
df.columns

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub_category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year_month'],
      dtype='object')

In [11]:
# Products Table
products_df = df[['category', 'sub_category']].reset_index(drop=True)
products_df['product_id'] = range(1, len(products_df) + 1)
products_df = products_df[['product_id', 'category', 'sub_category']]
products_df.head()

   product_id     category      sub_category
0           1  Electronics  Electronic Games
1           2  Electronics  Electronic Games
2           3  Electronics  Electronic Games
3           4  Electronics          Printers
4           5  Electronics          Printers

In [12]:
# Date Table
dates_df = df[['order_date', 'year_month']].drop_duplicates().reset_index(drop=True)
dates_df['date_id'] = range(1, len(dates_df) + 1)
dates_df = dates_df[['date_id', 'order_date', 'year_month']]

dates_df.head()

   date_id  order_date year_month
0        1  2023-06-27    2023-06
1        2  2024-12-27    2024-12
2        3  2021-07-25    2021-07
3        4  2024-05-11    2024-05
4        5  2021-10-09    2021-10

In [13]:
# fact_sales Table
fact_sales_df = df[['order_id', 'amount', 'profit', 'category',  'city', 'order_date', 'state', 'customername']].copy()
fact_sales_df['SaleID'] = range(1, len(fact_sales_df) + 1)

# Option 1: If you want to use only the available customer IDs and fill the rest with NaN
fact_sales_df['customer_id'] = None  # Initialize with None
fact_sales_df.loc[:len(customer_df)-1, 'customer_id'] = customer_df['customer_id'].values  # Assign available values


# For Products_id
fact_sales_df['Products_id'] = None
fact_sales_df.loc[:len(products_df)-1, 'product_id'] = products_df['product_id'].values

# For date_id
fact_sales_df['date_id'] = None
fact_sales_df.loc[:len(dates_df)-1, 'date_id'] = dates_df['date_id'].values

fact_sales_df = fact_sales_df[['order_id', 'amount', 'profit', 'category', 'city', 'order_date', 'state', 'customername', 'customer_id', 'product_id', 'date_id']]
fact_sales_df.head()

,order_id,amount,profit,category,city,order_date,state,customername,customer_id,product_id,date_id
0,B-26776,9726,1275,Electronics,Miami,2023-06-27,Florida,David Padilla,1,1.0,1
1,B-26776,9726,1275,Electronics,Chicago,2024-12-27,Illinois,Connor Morgan,2,2.0,2
2,B-26776,9726,1275,Electronics,Buffalo,2021-07-25,New York,Robert Stone,3,3.0,3
3,B-26776,4975,1330,Electronics,Miami,2023-06-27,Florida,David Padilla,4,4.0,4
4,B-26776,4975,1330,Electronics,Chicago,2024-12-27,Illinois,Connor Morgan,5,5.0,5

In [14]:
# Check for duplicates
print(f"Total rows: {len(fact_sales_df)}")
print(f"Unique order_ids: {fact_sales_df['order_id'].nunique()}")
print(f"Duplicates: {fact_sales_df['order_id'].duplicated().sum()}")

Total rows: 1194
Unique order_ids: 547
Duplicates: 647

In [15]:
# See the duplicate rows
duplicates = fact_sales_df[fact_sales_df['order_id'].duplicated(keep=False)]
print(duplicates.sort_values('order_id'))

     order_id  amount  profit         category           city  order_date  \
237   B-25004    9965    3033  Office Supplies        Buffalo  2023-09-01
236   B-25004    9965    3033  Office Supplies  San Francisco  2020-06-17
826   B-25006    5831    1574  Office Supplies          Miami  2023-07-16
825   B-25006    5831    1574  Office Supplies      San Diego  2024-07-18
824   B-25006    5831    1574  Office Supplies  San Francisco  2022-11-16
...       ...     ...     ...              ...            ...         ...
500   B-26978    1108     167      Electronics    Springfield  2025-03-07
1078  B-26980    9752    3618        Furniture      Rochester  2024-02-21
1079  B-26980    9752    3618        Furniture         Peoria  2022-10-31
481   B-26988    2109     681      Electronics      Rochester  2021-12-03
480   B-26988    6255     437  Office Supplies      Rochester  2021-12-03

           state           customername customer_id  product_id date_id
237     New York           Frank Garcia         238       238.0     238
236   California      Jennifer Marshall         237       237.0     237
826      Florida       Tiffany Robinson        None       827.0    None
825   California           Daniel Dixon        None       826.0    None
824   California    Jeffrey Johnson III        None       825.0    None
...          ...                    ...         ...         ...     ...
500     Illinois           Roger Harris         501       501.0     501
1078    New York           Mary Johnson        None      1079.0    None
1079    Illinois          Joseph Knight        None      1080.0    None
481     New York  Ms. Barbara Cervantes         482       482.0     482
480     New York  Ms. Barbara Cervantes         481       481.0     481

[963 rows x 11 columns]

In [16]:
# Remove duplicates (keep first occurrence)
fact_sales_df = fact_sales_df.drop_duplicates(subset='order_id', keep='first')

In [17]:
fact_sales_df.head()

,order_id,amount,profit,category,city,order_date,state,customername,customer_id,product_id,date_id
0,B-26776,9726,1275,Electronics,Miami,2023-06-27,Florida,David Padilla,1,1.0,1
6,B-26942,1525,185,Office Supplies,Orlando,2024-05-11,Florida,John Fields,7,7.0,7
8,B-26640,883,117,Electronics,Los Angeles,2022-11-18,California,Richard Kelley,9,9.0,9
10,B-25890,2516,734,Furniture,New York City,2023-11-12,New York,Jacqueline Hubbard,11,11.0,11
11,B-25102,2975,462,Office Supplies,New York City,2020-03-23,New York,Jessica Anderson,12,12.0,12

In [18]:
#f"postgresql://postgres:{password}@localhost:5432/Analytics"

In [19]:
# First, you need to create a proper database connection with the correct credentials
from sqlalchemy import create_engine

# Replace these with your actual database credentials
username = "postgres"
password = "Amaka2012"  # Make sure to use the correct password
host = "localhost"
port = "5433"
database = "Sales_analytics"

# Create the database connection string
connection_string = f"postgresql://{username}:{password}@{host}:{port}/{database}"

# Create the SQLAlchemy engine
engine = create_engine(connection_string)

try:
    with engine.connect() as conn:
        print("✅ Connection successful!")
except Exception as e:
    print("❌ Connection failed:", e)


# Now use the engine to write your dataframes to the database
dates_df.to_sql("date", engine, if_exists='replace', index=False)
products_df.to_sql("products", engine, if_exists='replace', index=False)
customer_df.to_sql("customers", engine, if_exists='replace', index=False)

# Finally, create the fact table that depends on the dimension tables
fact_sales_df.to_sql("sales", engine, if_exists='replace', index=False)

✅ Connection successful!

547